Tekla Open API Reference for Tekla Structures 2025
Line Properties
The Line type exposes the following members.
Properties
Name | Description
Attributes
 The attributes for the line.
Bulge
 The bulge (curve) to use for the line (a bulge is the ratio between the height and width of an object).
EndPoint
 The end point of the line.
Hideable
 Accesses the information if this object is hidden or not or if it should be.
 (Inherited from GraphicObject.)
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
 (Inherited from DatabaseObject.)
StartPoint
 The start point of the line.
Top
See Also
Reference
Line Class
Tekla.Structures.Drawing Namespace